app/Controllers/Usuario.php

    public function ModalUsuario(int $ID){
        $usuarioModel = new UsuarioModel();
        return view('ModalViews/UsuarioModal',['dados' => $usuarioModel->where('id', $ID)->orderBy('id')->first()]);
---
SELECT *
FROM `usuario`
WHERE `id` = 30
ORDER BY `id`
 LIMIT 1

    public function TabelaUsuario()
    {
        $usuarioModel = new UsuarioModel();
        return json_encode(view('TableViews/UsuarioTable',['dados' => $usuarioModel->orderBy('id')->findAll()]));
---
SELECT *
FROM `usuario`
ORDER BY `id`

    public function CadastrarUsuario(){
        $usuarioModel = new UsuarioModel();
        $data = [
            'nome'       => $this->request->getVar('Nome'),
            'categoria'  => $this->request->getVar('Categoria'),
            'email'      => $this->request->getVar('Email'),
            'senha'      => $this->request->getVar('Senha')
        ];
        $usuarioModel->insert($data);
---
INSERT INTO `usuario` (`nome`, `categoria`, `email`, `senha`) VALUES ('PINGO', '3', 'pingo@mail.com', '1234')