app/Controllers/Usuario.php

    public function TabelaUsuario()
    {
        $usuarioModel = new UsuarioModel();
        return json_encode(view('TableViews/UsuarioTable',['dados' => $usuarioModel->orderBy('id')->findAll()]));
---
SELECT *
FROM `usuario`
ORDER BY `id`